# Автор Ігор Хруневич
# Цю міні-програму створено, щоб зацікавити дітей програмуванням
# Користуйтесь, вивчайте, досліджуйте, змінюйте - експериментуйте

import turtle

print("Розрахуйте S площу квадрата")
print("Введіть розмір сторони ?")
a = float(input("a = "))
print("Площа S = a*a або, а в квадраті.")
print("Площа = %.2f" % (a * a))
print ("Поки Ви звіряєте свій розв'язок із розв'язком даної програми, черепашка намалювала Вам ваш квадрат . Знайдіть його у себе на моніторі.")
turtle.forward(a*37)
turtle.left(90)
turtle.forward(a*37)
turtle.left(90)
turtle.forward(a*37)
turtle.left(90)
turtle.forward(a*37)

